package data

data class Riddle(val question: String, val answer: String)

val riddles = listOf(
    Riddle("Зимой и летом одним цветом", "Ёлка"),
    Riddle("Висит груша, нельзя скушать", "Лампочка"),
    Riddle("Не лает, не кусает, а в дом не пускает", "Замок"),
    Riddle("Без рук, без ног, а рисовать умеет", "Мороз"),
    Riddle("Сто одежек и все без застежек", "Капуста"),
    Riddle("Два конца, два кольца, а посередине гвоздик", "Ножницы"),
    Riddle("Вороново крыло, белая пелена", "Ночь и день"),
    Riddle("Сидит дед во сто шуб одет, кто его раздевает, тот слезы проливает", "Лук"),
    Riddle("Бел, как снег, в черную полоску одет", "Зебра"),
    Riddle("Без окон, без дверей, полна горница людей", "Огурец"),
    Riddle("Не огонь, а жжется", "Крапива"),
    Riddle("На дворе горой, а в избе водой", "Снег"),
    Riddle("Лежит, молчит, а время говорит", "Часы"),
    Riddle("Ходит по полю, а поля не знает", "Тень"),
    Riddle("Висит на стене, звенит, а пройти не велит", "Колокольчик")
)